# RepeaterBounds Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeaterBounds Class
Members See Also
---
Represents bounds of the array of repeating references in 0, 1, or 2 dimensions. (See RepeatingReferenceSource).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class RepeaterBounds : IDisposable
```

Visual Basic
---
```text
Public Class RepeaterBounds _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RepeaterBounds : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RepeaterBounds
# See Also
RepeaterBounds Members
Autodesk.Revit.DB Namespace